In [1]:
import pandas as pd
from sqlalchemy import create_engine
from time import time

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [3]:
engine.connect()

In [4]:
chunks = 100000
df_iter = pd.read_csv('green_tripdata_2019-10.csv', iterator=True, chunksize=chunks)

In [5]:
count = 0
full_size = 0
while True:
    try:
        t_start = time()
        count += 1
        df = next(df_iter)
        full_size += len(df)
        
        df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
        df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    
        df.to_sql(name='green_taxi_data', con=engine, if_exists='append')
        t_end = time()
        print(f'{count}. insertanother chunk..., took %.3f second' % (t_end - t_start))
    except StopIteration:
        print(f'Insertion complited. All {full_size} lines inserted into the postgres database!')
        break

1. insertanother chunk..., took 4.960 second
2. insertanother chunk..., took 4.814 second
3. insertanother chunk..., took 4.845 second

/var/folders/5_/l16w4rr52cjb2dbdx3j2d4ym0000gn/T/ipykernel_5676/1466359250.py:7: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = next(df_iter)

4. insertanother chunk..., took 4.907 second
5. insertanother chunk..., took 3.403 second
Insertion complited. 476386 lines inserted into the postgres database!

In [6]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
400000,NaN,2019-10-06 15:38:00,2019-10-06 16:24:00,NaN,NaN,42,225,NaN,12.43,25.85,5.50,0.5,0.0,6.12,NaN,0.0,37.97,NaN,NaN,NaN
400001,NaN,2019-10-06 15:22:00,2019-10-06 15:51:00,NaN,NaN,235,159,NaN,3.71,28.32,2.75,0.5,0.0,0.00,NaN,0.0,31.57,NaN,NaN,NaN
400002,NaN,2019-10-06 15:46:00,2019-10-06 16:42:00,NaN,NaN,76,145,NaN,7.61,33.81,2.75,0.5,0.0,0.00,NaN,0.0,37.06,NaN,NaN,NaN
400003,NaN,2019-10-06 15:34:00,2019-10-06 15:51:00,NaN,NaN,259,242,NaN,5.17,24.43,2.75,0.5,0.0,0.00,NaN,0.0,27.68,NaN,NaN,NaN
400004,NaN,2019-10-06 15:40:00,2019-10-06 16:09:00,NaN,NaN,160,148,NaN,7.07,31.58,2.75,0.5,0.0,0.00,NaN,0.0,34.83,NaN,NaN,NaN

In [7]:
df_zone = pd.read_csv('taxi_zone_lookup.csv')

In [8]:
print(pd.io.sql.get_schema(df_zone, name='taxi_zone_lookup.csv'))

CREATE TABLE "taxi_zone_lookup.csv" (
"LocationID" INTEGER,
  "Borough" TEXT,
  "Zone" TEXT,
  "service_zone" TEXT
)

In [9]:
df_zone.head(5)

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [19]:
df_zone.to_sql(name='taxi_zone_lookup', con=engine, if_exists='append')

265

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone